20220621/AccumulationRegisters/тм_БонусныеНакопленияПолный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>тм_БонусныеНакопленияПолный</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНакоплений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_БонусныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентНакопления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

20220621/InformationRegisters/тм_НастройкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_НастройкиКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачисляемыйПроцентБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_БонусныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20220621/AccumulationRegisters/тм_БонусныеНакопленияПолный/Ext/ManagerModule.bsl
Процедура ЗаписатьБонусы(ДокументОбъект) Экспорт

	НастройкиКонтрагентов = РегистрыСведений.тм_НастройкиКонтрагентов.Получить(Новый Структура("Контрагент", ДокументОбъект.Контрагент));
	
	Если Не ЗначениеЗаполнено(НастройкиКонтрагентов.БонусныйСчет) Тогда
		Сообщить("Не указан бонусный счет контрагента для начисления!");
		Возврат;
	КонецЕсли; 
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	
	ДокументОбъект.Движения.тм_БонусныеНакопленияПолный.Записывать = Истина;
		
	Если Не ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Запасы") = Неопределено Тогда
		Для каждого СтрокаЗапасы Из ДокументОбъект.Запасы Цикл
			Движение = ДокументОбъект.Движения.тм_БонусныеНакопленияПолный.Добавить();
			Движение.Период = ДатаЗаписи;
			Движение.Контрагент = ДокументОбъект.Контрагент;
			Движение.БонусныйСчет = НастройкиКонтрагентов.БонусныйСчет;
			Движение.ПроцентНакопления = НастройкиКонтрагентов.НачисляемыйПроцентБонусов;
			Движение.Номенклатура = СтрокаЗапасы.Номенклатура;
			Движение.СуммаНакоплений = СтрокаЗапасы.Сумма * НастройкиКонтрагентов.НачисляемыйПроцентБонусов/100;				
		КонецЦикла;  
	КонецЕсли; 
	
	Если Не ДокументОбъект.Метаданные().ТабличныеЧасти.Найти("Работы") = Неопределено Тогда
		Для каждого СтрокаРаботы Из ДокументОбъект.Работы Цикл
			Если СтрокаРаботы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				Продолжить;
			КонецЕсли; 
			Движение = ДокументОбъект.Движения.тм_БонусныеНакопленияПолный.Добавить();
			Движение.Период = ДатаЗаписи;
			Движение.Контрагент = ДокументОбъект.Контрагент;
			Движение.БонусныйСчет = НастройкиКонтрагентов.БонусныйСчет;
			Движение.ПроцентНакопления = НастройкиКонтрагентов.НачисляемыйПроцентБонусов;
			Движение.Номенклатура = СтрокаРаботы.Номенклатура;
			Движение.СуммаНакоплений = СтрокаРаботы.Сумма * НастройкиКонтрагентов.НачисляемыйПроцентБонусов/100;				
		КонецЦикла;  
	КонецЕсли; 

КонецПроцедуры
